In [96]:
import pandas as pd
df=pd.read_csv("titanic (1).csv")
df.head(3)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1

In [97]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [98]:
df.head(5)

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [99]:
target=df.Survived

In [100]:
inputs=df.drop('Survived',axis='columns')

In [101]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [102]:
inputs1=pd.concat([inputs,dummies],axis='columns')
inputs1.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [103]:
inputs1.drop('Sex',axis='columns',inplace=True)
inputs1.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [105]:
inputs1.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [106]:
inputs1.Age=inputs1.Age.fillna(inputs.Age.mean())
inputs1.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [107]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs1,target,test_size=0.2)

In [108]:
len(x_train)

712

In [109]:
len(x_test)

179

In [110]:
len(y_train)

712

In [111]:
len(y_test)

179

In [112]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [113]:
model.fit(x_train,y_train)

GaussianNB()

In [114]:
model.score(x_test,y_test)

0.8324022346368715

In [115]:
x_test[:10]

     Pclass        Age      Fare  female  male
200       3  28.000000    9.5000       0     1
29        3  29.699118    7.8958       0     1
2         3  26.000000    7.9250       1     0
744       3  31.000000    7.9250       0     1
742       1  21.000000  262.3750       1     0
56        2  21.000000   10.5000       1     0
491       3  21.000000    7.2500       0     1
751       3   6.000000   12.4750       0     1
716       1  38.000000  227.5250       1     0
775       3  18.000000    7.7500       0     1

In [94]:
y_test[:10]

333    0
718    0
778    0
57     0
881    0
597    0
425    0
645    1
708    1
188    0
Name: Survived, dtype: int64

In [95]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)